# IFC_DMSetObjectCond

## Description
Sets the Condition for specified Object.

```pascal
FUNCTION IFC_DMSetObjectCond(
				strObjectName : STRING;
				strCondition  : STRING): BOOLEAN;
```

```python
def vs.IFC_DMSetObjectCond(strObjectName, strCondition):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strObjectName|STRING|   |
|strCondition|STRING|   |

## Version
Availability: from Vectorworks 2021

## Category
* IFC